{
  "_flash_attn_2_enabled": true,
  "architectures": [
    "Idefics3ForConditionalGeneration"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 100264,
  "eos_token_id": 100338,
  "freeze_lm_head": true,
  "freeze_text_layers": true,
  "freeze_text_module_exceptions": [],
  "freeze_vision_layers": true,
  "freeze_vision_module_exceptions": [],
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 576,
  "image_token_id": 100270,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "max_position_embeddings": 8192,
  "mlp_bias": false,
  "model_type": "idefics3",
  "neftune_noise_alpha": 0.0,
  "num_attention_heads": 9,
  "num_hidden_layers": 30,
  "num_key_value_heads": 3,
  "pad_token_id": 100256,
  "perceiver_config": {
    "attention_dropout": 0.0,
    "hidden_act": "silu",
    "model_type": "vllama3",
    "num_key_value_heads": 1,
    "qk_layer_norms_perceiver": false,
    "resampler_depth": 6,
    "resampler_head_dim": 96,
    "resampler_n_heads": 16,
    "resampler_n_latents": 64
  },
  "pixel_shuffle_factor": 4,
  "pretraining_tp": 1,
  "qk_layer_norms": false,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 100000.0,
  "scale_factor": 4,
  "text_config": {
    "architectures": ["VLlama3ForCausalLM"],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 100257,
    "eos_token_id": 100257,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 576,
    "initializer_range": 0.02,
    "intermediate_size": 1536,
    "max_position_embeddings": 8192,
    "mlp_bias": false,
    "model_type": "llama",
    "num_attention_heads": 9,
    "num_hidden_layers": 30,
    "num_key_value_heads": 3,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-5,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 100480,
    "tie_word_embeddings": false
  },
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_cache": false,
  "use_resampler": false,
  "vision_config": {
    "attention_dropout": 0.0,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 768,
    "image_size": 512,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-06,
    "max_image_size": {
      "longest_edge": 512
    },
    "model_type": "idefics3_vision",
    "num_attention_heads": 12,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "patch_size": 16,
    "size": {
      "longest_edge": 2048
    },
    "torch_dtype": "bfloat16",
    "use_base_siglip": true
  },
  "vocab_size": 100480
}
